renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/utility/r_simple_filesystem_on_dataflash.c

/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2020 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/

/* mbedtls */
#include "mbedtls/sha256.h"	/* this will change to Renesas SHA256 library to improve more easy to integrate by using FIT mechanism. */

/* C runtime includes. */
#include <stdio.h>
#include <string.h>

/* Renesas RX platform includes */
#include "platform.h"
#include "r_flash_rx_if.h"
#include "r_simple_filesystem_on_dataflash_if.h"

/* define the word "Simple Filesystem on Dataflash" as "SFD". */
#define SFD_DATA_STATUS_EMPTY 0
#define SFD_DATA_STATUS_REGISTERED 1
#define SFD_DATA_STATUS_HIT 2

#define MAX_CHECK_DATAFLASH_AREA_RETRY_COUNT 3

#if defined (BSP_MCU_RX72N)
#define SFD_CONTROL_BLOCK_INITIAL_DATA \
    {\
        /* uint8_t local_storage[((FLASH_DF_BLOCK_SIZE * FLASH_NUM_BLOCKS_DF) / 4) - (sizeof(SFD_DATA) * SFD_OBJECT_HANDLES_NUM) - SFD_SHA256_LENGTH]; */\
        {0x00},\
        /* SFD_DATA sfd_data[SFD_OBJECT_HANDLES_NUM]; */\
        {0x00},\
    },\
    /* uint8_t hash_sha256[SFD_SHA256_LENGTH]; */\
    {0xd2, 0x63, 0xc7, 0xc6, 0x0b, 0x6f, 0x98, 0x06, 0x23, 0x51, 0x0b, 0x23, 0xa0, 0x22, 0x28, 0xfd, 0x66, 0x9b, 0x55, 0x8f, 0x19, 0x57, 0xdb, 0x78, 0x83, 0xb7, 0x06, 0xb2, 0x47, 0x13, 0x3c, 0x92},
#else
#error "Simple Filesystem on Dataflash (SFD) does not support your MCU"
#endif

#define SFD_DEBUG_PRINT( X )  /* printf( X ) */

#define SFD_DATA_FLASH_UPDATE_STATE_INITIALIZE 0
#define SFD_DATA_FLASH_UPDATE_STATE_ERASE 1
#define SFD_DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE 2
#define SFD_DATA_FLASH_UPDATE_STATE_WRITE 3
#define SFD_DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE 4
#define SFD_DATA_FLASH_UPDATE_STATE_FINALIZE 5
#define SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED 6
#define SFD_DATA_FLASH_UPDATE_STATE_ERROR 103

typedef struct _pkcs_storage_control_block_sub
{
    uint8_t local_storage[SFD_LOCAL_STORAGE_SIZE];
    SFD_DESCRIPTOR sfd_data[SFD_OBJECT_HANDLES_NUM];
} SFD_STORAGE_CONTROL_BLOCK_SUB;

typedef struct _SFD_CONTROL_BLOCK
{
    SFD_STORAGE_CONTROL_BLOCK_SUB data;
    uint8_t hash_sha256[SFD_SHA256_LENGTH];
} SFD_CONTROL_BLOCK;

static SFD_CONTROL_BLOCK sfd_control_block_data_image;        /* RX72N case: 4KB  */
static int current_handle_index = 0;

R_BSP_ATTRIB_SECTION_CHANGE(C, _SYSTEM_CONFIG , 1)
static const SFD_CONTROL_BLOCK sfd_control_block_data = {SFD_CONTROL_BLOCK_INITIAL_DATA};
R_BSP_ATTRIB_SECTION_CHANGE_END

R_BSP_ATTRIB_SECTION_CHANGE(C, _SYSTEM_CONFIG_MIRROR , 1)
static const SFD_CONTROL_BLOCK sfd_control_block_data_mirror = {SFD_CONTROL_BLOCK_INITIAL_DATA};
R_BSP_ATTRIB_SECTION_CHANGE_END

static void update_dataflash_data_from_image(void);
static void update_dataflash_data_mirror_from_image(void);
static void check_dataflash_area(uint32_t retry_counter);

static void data_flash_update_status_initialize(void);
static void update_data_flash_callback_function(void *event);

typedef struct _update_data_flash_control_block {
	uint32_t status;
}UPDATA_DATA_FLASH_CONTROL_BLOCK;

/******************************************************************************
 Private global variables
 ******************************************************************************/
static UPDATA_DATA_FLASH_CONTROL_BLOCK update_data_flash_control_block;

sfd_err_t R_SFD_Open(void)
{
	sfd_err_t sfd_err = SFD_FATAL_ERROR;

	if(FLASH_CFG_DATA_FLASH_BGO == 1)
	{
		/* check the hash */
		check_dataflash_area(0);
		/* copy data from storage to ram */
		memcpy(&sfd_control_block_data_image, (void *)&sfd_control_block_data, sizeof(sfd_control_block_data_image));
		sfd_err = SFD_SUCCESS;
	}
	else
	{
		SFD_DEBUG_PRINT("Please set FLASH_CFG_DATA_FLASH_BGO to 1 in r_flash_config_rx.h.\r\n");
		sfd_err = SFD_FATAL_ERROR;
	}
    return sfd_err;
}

SFD_HANDLE R_SFD_SaveObject(uint8_t *label, uint32_t label_length, uint8_t *data, uint32_t data_length)
{
    uint32_t i;
    uint8_t hash_sha256[SFD_SHA256_LENGTH];
    SFD_HANDLE xHandle = SFD_HANDLE_INVALID;
    mbedtls_sha256_context ctx;

    mbedtls_sha256_init(&ctx);

    /* check the hash */
    check_dataflash_area(0);

    /* copy data from storage to ram */
    memcpy(&sfd_control_block_data_image, (void *)&sfd_control_block_data, sizeof(sfd_control_block_data_image));

    /* search specified label value from object_handle_dictionary */
    for (i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
    {
        if (!strncmp((char * )&sfd_control_block_data_image.data.sfd_data[i].label, (char * )label, label_length))
        {
            xHandle = i;
        }
    }

    /* pre-calculate -> total stored data size : pre-calculate phase */
    uint32_t total_stored_data_size = 0;

    /* specified label found: overwrite specified data into registered label.  */
    if (xHandle != SFD_HANDLE_INVALID)
    {
        for (int i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
        {
            if (sfd_control_block_data_image.data.sfd_data[i].status == SFD_DATA_STATUS_REGISTERED)
            {
                total_stored_data_size += sfd_control_block_data_image.data.sfd_data[i].data_length;
            }
        }

