renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/utility/r_simple_filesystem_on_dataflash.c
        /* remove current xHandle from sfd_data */
        if (sfd_control_block_data_image.data.sfd_data[xHandle].status == SFD_DATA_STATUS_REGISTERED)
        {
            uint32_t move_target_xHandle = 0, move_target_index = 0;

            uint32_t delete_target_index = sfd_control_block_data_image.data.sfd_data[xHandle].local_storage_index;
            uint32_t delete_target_data_size = sfd_control_block_data_image.data.sfd_data[xHandle].data_length;

            /* Search move target index and handle  */
            for (int i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
            {
                if ((sfd_control_block_data_image.data.sfd_data[i].status == SFD_DATA_STATUS_REGISTERED)
                        && (sfd_control_block_data_image.data.sfd_data[i].local_storage_index == (delete_target_index + delete_target_data_size)))
                {
                    move_target_xHandle = i;
                    move_target_index = sfd_control_block_data_image.data.sfd_data[i].local_storage_index;
                    break;
                }
            }

            if (move_target_xHandle != 0)
            {
                /* Move target index to delete target index */
                memmove(
                    (void * )&sfd_control_block_data_image.data.local_storage[delete_target_index],
                    (void * )&sfd_control_block_data_image.data.local_storage[move_target_index],
                    (size_t )total_stored_data_size - move_target_index);

                /* Fix index of all moved data  */
                for (int i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
                {
                    if (sfd_control_block_data_image.data.sfd_data[i].local_storage_index > delete_target_index)
                    {
                        sfd_control_block_data_image.data.sfd_data[i].local_storage_index -= delete_target_data_size;
                    }
                }
            }

            /* Recalculate the end of data storage  */
            total_stored_data_size -= delete_target_data_size;

            sfd_control_block_data_image.data.sfd_data[xHandle].local_storage_index = 0;
            sfd_control_block_data_image.data.sfd_data[xHandle].data_length = 0;

        }
    }
	/* specified label not found: add specified data as new label. */
	else
	{
		/* search target blank entry */
        for (int i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
        {
            if (sfd_control_block_data_image.data.sfd_data[i].status == SFD_DATA_STATUS_EMPTY)
            {
                xHandle = i;
            	break;
            }
            else if (sfd_control_block_data_image.data.sfd_data[i].status == SFD_DATA_STATUS_REGISTERED)
            {
                total_stored_data_size += sfd_control_block_data_image.data.sfd_data[i].data_length;
            }
        }
	}

    if(data_length + total_stored_data_size < SFD_LOCAL_STORAGE_SIZE)
    {
		strncpy((char * )sfd_control_block_data_image.data.sfd_data[xHandle].label, (char * )label, SFD_HANDLES_LABEL_MAX_LENGTH);
		sfd_control_block_data_image.data.sfd_data[xHandle].label_length = label_length;
		sfd_control_block_data_image.data.sfd_data[xHandle].local_storage_index = total_stored_data_size;
		sfd_control_block_data_image.data.sfd_data[xHandle].data_length = data_length;
		sfd_control_block_data_image.data.sfd_data[xHandle].status = SFD_DATA_STATUS_REGISTERED;
		sfd_control_block_data_image.data.sfd_data[xHandle].xHandle = xHandle;
		memcpy(&sfd_control_block_data_image.data.local_storage[total_stored_data_size], data, data_length);

		/* update the hash */
		mbedtls_sha256_starts_ret(&ctx, 0); /* 0 means SHA256 context */
		mbedtls_sha256_update_ret(&ctx, (unsigned char *)&sfd_control_block_data_image.data, sizeof(sfd_control_block_data.data));
		mbedtls_sha256_finish_ret(&ctx, hash_sha256);
		memcpy(sfd_control_block_data_image.hash_sha256, hash_sha256, sizeof(hash_sha256));

		/* update data from ram to storage */
		data_flash_update_status_initialize();
		while ( update_data_flash_control_block.status < SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED )
		{
			update_dataflash_data_from_image();
		}
		if (update_data_flash_control_block.status == SFD_DATA_FLASH_UPDATE_STATE_ERROR)
		{
			SFD_DEBUG_PRINT(("ERROR: Update data flash data from image\r\n"));
			while(1);
		}
		data_flash_update_status_initialize();
		while ( update_data_flash_control_block.status < SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED )
		{
			update_dataflash_data_mirror_from_image();
		}
		if (update_data_flash_control_block.status == SFD_DATA_FLASH_UPDATE_STATE_ERROR)
		{
			SFD_DEBUG_PRINT(("ERROR: Update data flash data mirror from image\r\n"));
			while(1);
		}
    }
    else
    {
    	xHandle = SFD_HANDLE_INVALID;
    }

    return xHandle;

}

sfd_err_t R_SFD_Close(void)
{
	/* nothing to do */
    return SFD_SUCCESS;
}

SFD_HANDLE R_SFD_FindObject( uint8_t *label, uint8_t label_length )
{
	SFD_HANDLE xHandle = SFD_HANDLE_INVALID;
    int i;

    for(i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
    {
        if(!strncmp((char *)&sfd_control_block_data_image.data.sfd_data[i].label, (char *)label, label_length))
        {
            if(sfd_control_block_data_image.data.sfd_data[i].status == SFD_DATA_STATUS_REGISTERED)
            {
                xHandle = i;
            }
        }
    }
    return xHandle;
}

sfd_err_t R_SFD_GetObjectValue( SFD_HANDLE xHandle,
                                 uint8_t **data,
                                 uint32_t *data_length)
{
	sfd_err_t xReturn = SFD_FATAL_ERROR;

    if (xHandle != SFD_HANDLE_INVALID)
    {
        *data = &sfd_control_block_data_image.data.local_storage[sfd_control_block_data_image.data.sfd_data[xHandle].local_storage_index];
        *data_length = sfd_control_block_data_image.data.sfd_data[xHandle].data_length;
    }
    return xReturn;
}

sfd_err_t R_SFD_Scan(uint8_t **label, uint32_t *label_length, uint8_t **data, uint32_t *data_length)
{
	int i;
	sfd_err_t xReturn = SFD_FATAL_ERROR;

