renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/application_code/renesas_code/utility/r_simple_filesystem_on_dataflash.c
	if(current_handle_index == -1)
	{
		xReturn = SFD_END_OF_LIST;
	}
	else
	{
		while(1)
		{
			if(sfd_control_block_data_image.data.sfd_data[current_handle_index].status == SFD_DATA_STATUS_REGISTERED)
			{
				*label = &sfd_control_block_data_image.data.sfd_data[current_handle_index].label;
				*label_length = sfd_control_block_data_image.data.sfd_data[current_handle_index].label_length;
				*data = &sfd_control_block_data_image.data.local_storage[sfd_control_block_data_image.data.sfd_data[current_handle_index].local_storage_index];
				*data_length = sfd_control_block_data_image.data.sfd_data[current_handle_index].data_length;
				current_handle_index++;
				xReturn = SFD_SUCCESS;
				break;
			}
			else
			{
				current_handle_index++;
			}
			if(current_handle_index == SFD_OBJECT_HANDLES_NUM)
			{
				current_handle_index = -1;
				break;
			}
		}
	}

	return xReturn;
}

sfd_err_t R_SFD_ResetScan(void)
{
	current_handle_index = 0;
	return SFD_SUCCESS;
}

uint32_t R_SFD_ReadPysicalSize(void)
{
	return (FLASH_DF_BLOCK_SIZE * FLASH_NUM_BLOCKS_DF);
}

uint32_t R_SFD_ReadAllocatedStorageSize(void)
{
	return SFD_LOCAL_STORAGE_SIZE;
}

uint32_t R_SFD_ReadFreeSize(void)
{
	SFD_HANDLE xHandle = SFD_HANDLE_INVALID;
    int i;
    uint32_t total_size = 0;

    for(i = 0; i < SFD_OBJECT_HANDLES_NUM; i++)
    {
    	total_size += sfd_control_block_data_image.data.sfd_data[i].data_length;
    }

	return (SFD_LOCAL_STORAGE_SIZE - total_size);
}

static void update_dataflash_data_from_image(void)
{
	flash_interrupt_config_t cb_func_info;
    static uint32_t required_dataflash_block_num;
    flash_err_t flash_error_code = FLASH_SUCCESS;

    switch(update_data_flash_control_block.status)
    {
        case SFD_DATA_FLASH_UPDATE_STATE_INITIALIZE: /* initialize */
        	cb_func_info.pcallback = update_data_flash_callback_function;
        	cb_func_info.int_priority = 15;
        	R_FLASH_Control(FLASH_CMD_SET_BGO_CALLBACK, (void *)&cb_func_info);
            required_dataflash_block_num = sizeof(SFD_CONTROL_BLOCK) / FLASH_DF_BLOCK_SIZE;
            if(sizeof(SFD_CONTROL_BLOCK) % FLASH_DF_BLOCK_SIZE)
            {
                required_dataflash_block_num++;
            }
            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_ERASE;
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_ERASE:
            SFD_DEBUG_PRINT(("erase dataflash(main)..."));
            R_BSP_InterruptsDisable();
            flash_error_code = R_FLASH_Erase((flash_block_address_t)&sfd_control_block_data, required_dataflash_block_num);
            R_BSP_InterruptsEnable();
            if(FLASH_SUCCESS == flash_error_code)
            {
                 SFD_DEBUG_PRINT(("OK\r\n"));
            }
            else
            {
                SFD_DEBUG_PRINT(("NG\r\n"));
                SFD_DEBUG_PRINT(("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code));
            }
            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE;
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_WRITE:
            SFD_DEBUG_PRINT(("write dataflash(main)..."));
            R_BSP_InterruptsDisable();
            flash_error_code = R_FLASH_Write((flash_block_address_t)&sfd_control_block_data_image, (flash_block_address_t)&sfd_control_block_data, FLASH_DF_BLOCK_SIZE * required_dataflash_block_num);
            R_BSP_InterruptsEnable();
            if(FLASH_SUCCESS == flash_error_code)
            {
                SFD_DEBUG_PRINT(("OK\r\n"));
            }
            else
            {
            	SFD_DEBUG_PRINT(("NG\r\n"));
            	SFD_DEBUG_PRINT(("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code));
            	return;
            }
            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE;
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_FINALIZE: /* finalize */
            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED;
            break;
        default:
            break;
    }
    return;
}

static void update_dataflash_data_mirror_from_image(void)
{
	flash_interrupt_config_t cb_func_info;
    static uint32_t required_dataflash_block_num;
    flash_err_t flash_error_code = FLASH_SUCCESS;

    switch(update_data_flash_control_block.status)
    {
    	case SFD_DATA_FLASH_UPDATE_STATE_INITIALIZE: /* initialize */
    		cb_func_info.pcallback = update_data_flash_callback_function;
    		cb_func_info.int_priority = 15;
    		R_FLASH_Control(FLASH_CMD_SET_BGO_CALLBACK, (void *)&cb_func_info);
            required_dataflash_block_num = sizeof(SFD_CONTROL_BLOCK) / FLASH_DF_BLOCK_SIZE;
            if(sizeof(SFD_CONTROL_BLOCK) % FLASH_DF_BLOCK_SIZE)
            {
                required_dataflash_block_num++;
            }

            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_ERASE;
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_ERASE:
            SFD_DEBUG_PRINT(("erase dataflash(mirror)..."));
            R_BSP_InterruptsDisable();
            flash_error_code = R_FLASH_Erase((flash_block_address_t)&sfd_control_block_data_mirror, required_dataflash_block_num);
            R_BSP_InterruptsEnable();
            if(FLASH_SUCCESS == flash_error_code)
            {
                SFD_DEBUG_PRINT(("OK\r\n"));
            }
            else
            {
                SFD_DEBUG_PRINT(("NG\r\n"));
                SFD_DEBUG_PRINT(("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code));
                return;
            }

            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE;
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_WRITE:
            SFD_DEBUG_PRINT(("write dataflash(mirror)..."));
            R_BSP_InterruptsDisable();
            flash_error_code = R_FLASH_Write((flash_block_address_t)&sfd_control_block_data_image, (flash_block_address_t)&sfd_control_block_data_mirror, FLASH_DF_BLOCK_SIZE * required_dataflash_block_num);
            R_BSP_InterruptsEnable();
            if(FLASH_SUCCESS == flash_error_code)
            {
                SFD_DEBUG_PRINT(("OK\r\n"));
            }
            else
            {
                SFD_DEBUG_PRINT(("NG\r\n"));
                SFD_DEBUG_PRINT(("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code));
                return;
            }
            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE;
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;
        case SFD_DATA_FLASH_UPDATE_STATE_FINALIZE: /* finalize */

            if(!memcmp(&sfd_control_block_data, &sfd_control_block_data_mirror, sizeof(SFD_CONTROL_BLOCK)))
            {
                SFD_DEBUG_PRINT(("data flash setting OK.\r\n"));
            }
            else
            {
                SFD_DEBUG_PRINT(("data flash setting NG.\r\n"));
                return;
            }
            update_data_flash_control_block.status = SFD_DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED;
            break;
        default:
    	    break;
    }
    return;
}

static void check_dataflash_area(uint32_t retry_counter)
{
    uint8_t hash_sha256[SFD_SHA256_LENGTH];
    mbedtls_sha256_context ctx;

    mbedtls_sha256_init(&ctx);

    if(retry_counter)
    {
        SFD_DEBUG_PRINT(("recover retry count = %d.\r\n", retry_counter));
        if(retry_counter == MAX_CHECK_DATAFLASH_AREA_RETRY_COUNT)
        {
            SFD_DEBUG_PRINT(("retry over the limit.\r\n"));
            while(1);
        }
    }
    SFD_DEBUG_PRINT(("data flash(main) hash check..."));
    mbedtls_sha256_starts_ret(&ctx, 0); /* 0 means SHA256 context */
    mbedtls_sha256_update_ret(&ctx, (unsigned char *)&sfd_control_block_data.data, sizeof(sfd_control_block_data.data));
    mbedtls_sha256_finish_ret(&ctx, hash_sha256);
    if(!memcmp(sfd_control_block_data.hash_sha256, hash_sha256, sizeof(hash_sha256)))
    {
        SFD_DEBUG_PRINT(("OK\r\n"));
        SFD_DEBUG_PRINT(("data flash(mirror) hash check..."));
        mbedtls_sha256_starts_ret(&ctx, 0); /* 0 means SHA256 context */
        mbedtls_sha256_update_ret(&ctx, (unsigned char *)&sfd_control_block_data_mirror.data, sizeof(sfd_control_block_data_mirror.data));
        mbedtls_sha256_finish_ret(&ctx, hash_sha256);
        if(!memcmp(sfd_control_block_data_mirror.hash_sha256, hash_sha256, sizeof(hash_sha256)))
        {
            SFD_DEBUG_PRINT(("OK\r\n"));
        }
        else
        {
            SFD_DEBUG_PRINT(("NG\r\n"));
            SFD_DEBUG_PRINT(("recover mirror from main.\r\n"));
            memcpy(&sfd_control_block_data_image, (void *)&sfd_control_block_data, sizeof(sfd_control_block_data));

